app/views/students/edit_achievements.html.erb

SELECT "achievements".* FROM "achievements" INNER JOIN "achievements_students" ON "achievements"."id" = "achievements_students"."achievement_id" WHERE "achievements_students"."student_id" = ? AND "achievements"."id" = ?  [["student_id", "1"], ["id", 1]]
---
  <li>
    <%= check_box_tag "achievements[#{a.id}]", true, @student.achievements.include?(a) %>