app/controllers/students_controller.rb

  def edit_achievements
    @student = Student.find(params[:id])
    @achievements = Achievement.all
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
SELECT "achievements".* FROM "achievements"

  def update_achievements
    @student = Student.find(params[:id])
    @student.achievements = []
    params[:achievements].keys.each do |a|
      @student.achievements << Achievement.find(a)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "achievements_students" ("student_id", "achievement_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", "2"], ["achievement_id", "2"], ["created_at", "2015-02-10 02:18:14.587040"], ["updated_at", "2015-02-10 02:18:14.587040"]]
SELECT "achievements".* FROM "achievements" INNER JOIN "achievements_students" ON "achievements"."id" = "achievements_students"."achievement_id" WHERE "achievements_students"."student_id" = ?  [["student_id", "2"]]