app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers"
SELECT "students".* FROM "students" WHERE "students"."teacher_id" = ?  [["teacher_id", 1]]
SELECT "achievements".* FROM "achievements"
---
  def index
    @teachers = Teacher.all

    @teachers_students = Student.where(teacher_id: session[:teacher_id] )
    # @teachers_students = Student.get_all_children_for_teacher_id( session[:teacher_id] )

    @achievements = Achievement.all